# PART 21

In [1]:
#Append Function=used to append rows of other dataframe to the end of the given df

In [2]:
import pandas as pd

In [3]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})

In [4]:
df2=pd.DataFrame({'A':[4,5,6],'B':[40,50,60]})

In [5]:
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   A   B
0  4  40
1  5  50
2  6  60

In [6]:
#Let's append them

In [7]:
df1.append(df2)

<ipython-input-7-8ab0723181fb>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   A   B
0  1  10
1  2  20
2  3  30
0  4  40
1  5  50
2  6  60

In [8]:
#ignore index for proper new dataframe

In [9]:
df1.append(df2,ignore_index=True)

<ipython-input-9-f66c09b25164>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2,ignore_index=True)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60

In [10]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1=pd.DataFrame({'C':[1,2,3],'B':[10,20,30]})

In [11]:
df1.append(df2,ignore_index=True)

<ipython-input-11-f66c09b25164>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2,ignore_index=True)

     C   B    A
0  1.0  10  NaN
1  2.0  20  NaN
2  3.0  30  NaN
3  NaN  40  4.0
4  NaN  50  5.0
5  NaN  60  6.0

# PART 22

In [14]:
#pandas pivot table

In [16]:
df=pd.read_csv('Movie_rating.csv')
df

       Genre  Year  Budget(M$)  Ratings%
0     Action  2008          28        48
1     Action  2009         200        63
2     Action  2008          32        57
3     Action  2010          20        52
4  Adventure  2009          18        84
5  Adventure  2010         105        44
6     Comedy  2010          20        70
7     Comedy  2008           8        81
8     Comedy  2009          30        71

In [17]:
df.pivot_table(index='Genre')

           Budget(M$)  Ratings%     Year
Genre
Action      70.000000        55  2008.75
Adventure   61.500000        64  2009.50
Comedy      19.333333        74  2009.00

In [18]:
#it's aggregated according to 'Genre' and made it as a index

In [21]:
df.pivot_table(index='Genre',columns='Year')#now according to 'year'==mean values shows and 'Genre' giving value

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          30.0  200.0   20.0     52.5  63.0  52.0
Adventure        NaN   18.0  105.0      NaN  84.0  44.0
Comedy           8.0   30.0   20.0     81.0  71.0  70.0

In [22]:
#BY default it is taking aggregate function= mean will use different functions

In [24]:
df.pivot_table(index='Genre',columns='Year',aggfunc='count')
#how many times the function came that much value we are getting

          Budget(M$)           Ratings%
Year            2008 2009 2010     2008 2009 2010
Genre
Action           2.0  1.0  1.0      2.0  1.0  1.0
Adventure        NaN  1.0  1.0      NaN  1.0  1.0
Comedy           1.0  1.0  1.0      1.0  1.0  1.0

In [26]:
df.pivot_table(index='Genre',columns='Year',aggfunc='max')

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          32.0  200.0   20.0     57.0  63.0  52.0
Adventure        NaN   18.0  105.0      NaN  84.0  44.0
Comedy           8.0   30.0   20.0     81.0  71.0  70.0

In [27]:
df.pivot_table(index='Genre',columns='Year',aggfunc='sum')

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          60.0  200.0   20.0    105.0  63.0  52.0
Adventure        NaN   18.0  105.0      NaN  84.0  44.0
Comedy           8.0   30.0   20.0     81.0  71.0  70.0

In [28]:
#value to replace missing value

In [30]:
df.pivot_table(index='Genre',columns='Year',fill_value='none')

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          30.0  200.0   20.0     52.5  63.0  52.0
Adventure       none   18.0  105.0     none  84.0  44.0
Comedy           8.0   30.0   20.0     81.0  71.0  70.0

In [33]:
#if any col having all nan value it is by default removed becz(dropna=True)by default

In [34]:
df.pivot_table(index='Genre',columns='Year',fill_value='none',margins=True)

          Budget(M$)                                  Ratings%             \
Year            2008       2009       2010        All     2008       2009
Genre
Action          30.0      200.0       20.0       70.0     52.5       63.0
Adventure       none       18.0      105.0       61.5     none       84.0
Comedy           8.0       30.0       20.0  19.333333     81.0       71.0
All        22.666667  82.666667  48.333333  51.222222     62.0  72.666667


Year            2010        All
Genre
Action          52.0       55.0
Adventure       44.0       64.0
Comedy          70.0       74.0
All        55.333333  63.333333

In [35]:
#margins returns mean of all rows and column values

In [37]:
df.pivot_table(index='Genre',columns='Year',aggfunc='sum',margins=True)#Grand Total

          Budget(M$)                    Ratings%
Year            2008   2009   2010  All     2008   2009   2010  All
Genre
Action          60.0  200.0   20.0  280    105.0   63.0   52.0  220
Adventure        NaN   18.0  105.0  123      NaN   84.0   44.0  128
Comedy           8.0   30.0   20.0   58     81.0   71.0   70.0  222
All             68.0  248.0  145.0  461    186.0  218.0  166.0  570

# Part 23

In [39]:
# MELT() == USED  TO TRANSFORM OR RESHAPE DATA

In [40]:
pd.melt(df)

      variable      value
0        Genre     Action
1        Genre     Action
2        Genre     Action
3        Genre     Action
4        Genre  Adventure
5        Genre  Adventure
6        Genre     Comedy
7        Genre     Comedy
8        Genre     Comedy
9         Year       2008
10        Year       2009
11        Year       2008
12        Year       2010
13        Year       2009
14        Year       2010
15        Year       2010
16        Year       2008
17        Year       2009
18  Budget(M$)         28
19  Budget(M$)        200
20  Budget(M$)         32
21  Budget(M$)         20
22  Budget(M$)         18
23  Budget(M$)        105
24  Budget(M$)         20
25  Budget(M$)          8
26  Budget(M$)         30
27    Ratings%         48
28    Ratings%         63
29    Ratings%         57
30    Ratings%         52
31    Ratings%         84
32    Ratings%         44
33    Ratings%         70
34    Ratings%         81
35    Ratings%         71

In [41]:
#Variable = all columns name and value= all values in df

In [43]:
pd.melt(df,id_vars=['Genre'])#u can specify any col name as a identifier variable

        Genre    variable  value
0      Action        Year   2008
1      Action        Year   2009
2      Action        Year   2008
3      Action        Year   2010
4   Adventure        Year   2009
5   Adventure        Year   2010
6      Comedy        Year   2010
7      Comedy        Year   2008
8      Comedy        Year   2009
9      Action  Budget(M$)     28
10     Action  Budget(M$)    200
11     Action  Budget(M$)     32
12     Action  Budget(M$)     20
13  Adventure  Budget(M$)     18
14  Adventure  Budget(M$)    105
15     Comedy  Budget(M$)     20
16     Comedy  Budget(M$)      8
17     Comedy  Budget(M$)     30
18     Action    Ratings%     48
19     Action    Ratings%     63
20     Action    Ratings%     57
21     Action    Ratings%     52
22  Adventure    Ratings%     84
23  Adventure    Ratings%     44
24     Comedy    Ratings%     70
25     Comedy    Ratings%     81
26     Comedy    Ratings%     71

In [46]:
pd.melt(df,id_vars=['Year'])#identifier = year

    Year    variable      value
0   2008       Genre     Action
1   2009       Genre     Action
2   2008       Genre     Action
3   2010       Genre     Action
4   2009       Genre  Adventure
5   2010       Genre  Adventure
6   2010       Genre     Comedy
7   2008       Genre     Comedy
8   2009       Genre     Comedy
9   2008  Budget(M$)         28
10  2009  Budget(M$)        200
11  2008  Budget(M$)         32
12  2010  Budget(M$)         20
13  2009  Budget(M$)         18
14  2010  Budget(M$)        105
15  2010  Budget(M$)         20
16  2008  Budget(M$)          8
17  2009  Budget(M$)         30
18  2008    Ratings%         48
19  2009    Ratings%         63
20  2008    Ratings%         57
21  2010    Ratings%         52
22  2009    Ratings%         84
23  2010    Ratings%         44
24  2010    Ratings%         70
25  2008    Ratings%         81
26  2009    Ratings%         71

In [45]:
#Unpivot = a df turn from a wide format(many columns) to a long format(few columns but many rows).

In [48]:
pd.melt(df,id_vars=['Year'],value_vars=['Genre'])#only showing genre value

   Year variable      value
0  2008    Genre     Action
1  2009    Genre     Action
2  2008    Genre     Action
3  2010    Genre     Action
4  2009    Genre  Adventure
5  2010    Genre  Adventure
6  2010    Genre     Comedy
7  2008    Genre     Comedy
8  2009    Genre     Comedy

In [49]:
pd.melt(df,id_vars=['Year'],value_vars=['Ratings%'])

   Year  variable  value
0  2008  Ratings%     48
1  2009  Ratings%     63
2  2008  Ratings%     57
3  2010  Ratings%     52
4  2009  Ratings%     84
5  2010  Ratings%     44
6  2010  Ratings%     70
7  2008  Ratings%     81
8  2009  Ratings%     71

In [50]:
#variable we are getting by default we wanna change that name

In [51]:
pd.melt(df,id_vars=['Year'],value_vars=['Ratings%'],var_name='Category')

   Year  Category  value
0  2008  Ratings%     48
1  2009  Ratings%     63
2  2008  Ratings%     57
3  2010  Ratings%     52
4  2009  Ratings%     84
5  2010  Ratings%     44
6  2010  Ratings%     70
7  2008  Ratings%     81
8  2009  Ratings%     71

In [52]:
#value we are getting by default we wanna change that name

In [53]:
pd.melt(df,id_vars=['Year'],value_vars=['Ratings%'],value_name='Data')

   Year  variable  Data
0  2008  Ratings%    48
1  2009  Ratings%    63
2  2008  Ratings%    57
3  2010  Ratings%    52
4  2009  Ratings%    84
5  2010  Ratings%    44
6  2010  Ratings%    70
7  2008  Ratings%    81
8  2009  Ratings%    71

# PART 24

In [54]:
#date time index functionality

In [56]:
df=pd.read_csv('student_10.csv')
df

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0
3  06-07-2019         NaN     11     NaN        0.0         NaN
4  07-07-2019      1005.0     11       A        4.0         NaN
5  08-07-2019         NaN     11       D       10.0         NaN
6  09-07-2019      1007.0     12       B        4.0        80.0
7  10-07-2019      1008.0     12       C        NaN        90.0
8  11-07-2019      1009.0     12       A        NaN        60.0
9  12-07-2019      1010.0     12       D        6.0        85.0

In [57]:
df.dtypes

Date           object
Student ID    float64
Class           int64
Section        object
Study hrs     float64
Percentage    float64
dtype: object

# date is of type object

In [60]:
type(df.Date[0])#type is string

str

In [61]:
df=pd.read_csv('student_10.csv',parse_dates=['Date'])
df

        Date  Student ID  Class Section  Study hrs  Percentage
0 2019-01-07      1001.0     10       A        2.0        50.0
1 2019-02-07      1002.0     10     NaN        NaN        80.0
2 2019-03-07         NaN     10     NaN        3.0        60.0
3 2019-06-07         NaN     11     NaN        0.0         NaN
4 2019-07-07      1005.0     11       A        4.0         NaN
5 2019-08-07         NaN     11       D       10.0         NaN
6 2019-09-07      1007.0     12       B        4.0        80.0
7 2019-10-07      1008.0     12       C        NaN        90.0
8 2019-11-07      1009.0     12       A        NaN        60.0
9 2019-12-07      1010.0     12       D        6.0        85.0

In [62]:
df.dtypes

Date          datetime64[ns]
Student ID           float64
Class                  int64
Section               object
Study hrs            float64
Percentage           float64
dtype: object

In [63]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp